## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_resource_group.rg must be replaced
-/+ resource "azurerm_resource_group" "rg" {
      ~ id         = "/subscriptions/d425d56b-b751-47db-9b41-a7cffd203508/resourceGroups/rg-chief-owl" -> (known after apply)
      ~ name       = "rg-chief-owl" -> (known after apply) # forces replacement
      - tags       = {} -> null
        # (2 unchanged attributes hidden)
    }

  # random_pet.rg_name must be replaced
-/+ resource "random_pet" "rg_name" {
      ~ id        = "rg-chief-owl" -> (known after apply)
      ~ prefix    = "rg" -> "rgs" # forces replacement
        # (2 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  ~ resource_group_name = "rg-chief-owl" -> (known after apply)
```
</details>